app/Generator.php

select * from `contracts` where `contracts`.`id` = 5 limit 1
---
    public function getLastTotalAttribute()
    {
        $estimate=$this->estimate;
        $previousEstimates = $estimate->contract->estimates()->previousEstimates($estimate)->get();