app/Http/Controllers/ContractController.php

select `reason_social`, `id` from `companies` order by `reason_social` asc
---
    public function create()
    {
        $companies= Company::orderBy('reason_social')->pluck('reason_social', 'id');

select `reason_social`, `id` from `companies` order by `reason_social` asc
---
    public function edit(Contract $contract)
    {
        //dd($contract->companies()->count());
        $companies= Company::orderBy('reason_social')->pluck('reason_social', 'id');