app/Http/Controllers/LocationController.php

    public function index(Request $request)
    {
        $locations = Location::searchContract($request->contract_id)->orderBy('name','asc')->get();
---
select * from `locations` where `contract_id` = '5' order by `name` asc

    public function store(StoreLocation $request)
    {
        $user=auth()->user();
        if($location = Location::where('contract_id',$request['contract_id'])
            ->where('name',$request['name'])
            ->first()){
            Log::error("Duplicate location : $location $user");
            return redirect(route('location.index'))->withErrors('La ubicación que intentas grabar ya existe favor de verificar');
        }
        $location = Location::firstOrCreate([
            'name' => strtoupper($request['name']),
            'contract_id' => strtoupper($request['contract_id']),
            'address' => strtoupper($request['address']),
            'observations' => strtoupper($request['observations'])
        ]);

        if ($location){
            $concepts = $location->contract->concepts->all();
            foreach ($concepts as $concept){
                $generators = $concept->generators->all();
                foreach ($generators as $generator){
                    $generator->locations()->attach($location,['quantity' => 0]);
---
select * from `locations` where `contract_id` = '5' and `name` = 'prueba' limit 1
select * from `concepts` where `concepts`.`contract_id` = 5 and `concepts`.`contract_id` is not null
select * from `contracts` where `contracts`.`id` = '5' limit 1
insert into `generator_location` (`generator_id`, `location_id`, `quantity`) values (401, 26, 0)