app/Http/Controllers/SubGeneratorController.php

select * from `concepts` where `concepts`.`id` = 102 limit 1
---
    public function update(Request $request, $id)
    {
        $user=auth()->user();
        $generator = Generator::find($id);
        $total = 0;

        foreach ($generator->subGenerators()->get() as $subGenerator){
            $textRequest = 'quantitySubGenerator'.$subGenerator->id;
            $total+=$request[$textRequest];
        }

        if (($generator->lastTotal + $total) > $generator->concept->quantityMax ){
            $exceededQuantity = number_format(($generator->lastTotal + $total) - $generator->concept->quantityMax,6,'.',',');
            session()->flash('danger',"El acumulado anterior + la suma de la subdivisión, excede del 125% por $exceededQuantity de la cantidad permitida del concepto favor de revisar!!!");
            return redirect(route('generator.list', $generator->estimate->id));
        }

        foreach ($generator->subGenerators()->get() as $subGenerator){